app/views/horse_race/betting.html.erb


<% Horse.all.each do |horse| %>
---
SELECT `horses`.* FROM `horses`