app/views/horse_race/betting.html.erb

<div id="main_betting_menu" class="container">
<% Horse.all.each do |horse| %>
---
SELECT `horses`.* FROM `horses`