app/views/horse_race/index.html.erb

SELECT `horses`.* FROM `horses`
---

<% Horse.all.each do |horse| %>

SELECT `horses`.* FROM `horses`
---

<% Horse.all.each do |horse| %>