app/views/horse_race/race.html.erb


  <% Horse.all.each do |horse| %>
---
SELECT `horses`.* FROM `horses`