app/views/horse_race/race.html.erb


  <% Horse.order(:speed).each.with_index(1) do |horse, place| %>
      setTimeout(function() {
          var rankings = document.getElementById("rankings").getElementsByTagName("tbody")[0];

          var newRow = rankings.insertRow();

          var newHorse = newRow.insertCell(0);
          newHorse.textContent = "<%= horse.name %>";

          var newTime  = newRow.insertCell(1);
          newTime.textContent = "<%= format('%.2f', horse.speed) %>s";

          <% profit = Wager.select {|wager| wager.horse_id == horse.id}.map {|wager| (wager.hits? place) ? wager.payout : -wager.amount}.sum %>

	  var newProfit = newRow.insertCell(2);
	  <% if profit != 0 %>
	      newProfit.style.color = "<%= profit > 0 ? 'green' : 'red' %>";
	      newProfit.textContent = "$<%= format('%.2f', profit) %>";
	  <% end %>

      }, <%= horse.speed * 1000 %>);
---
SELECT MAX(`horses`.`speed`) FROM `horses`
SELECT `horses`.* FROM `horses` ORDER BY `horses`.`speed` ASC
SELECT `wagers`.* FROM `wagers`

<div class="background">
<% Horse.all.each do |horse| %>
---
SELECT `horses`.* FROM `horses`