app/views/shared/_horse_winners_bar.html.erb


<% Horse.order(speed: :desc).limit(3).each.with_index(1) do |horse, place| %>
---
SELECT `horses`.* FROM `horses` ORDER BY `horses`.`speed` DESC LIMIT 3