app/views/shared/_wager.html.erb

  </tr>
<% Wager.where(user_id: Current.session.user.id).each do |wager| %>
  <tr>
    <% horse  = Horse.find(wager.horse_id)
---
SELECT `wagers`.* FROM `wagers` WHERE `wagers`.`user_id` = 1
SELECT `horses`.* FROM `horses` WHERE `horses`.`id` = 2 LIMIT 1