app/controllers/horse_race_controller.rb

SELECT MAX(`horses`.`speed`) FROM `horses`
SELECT `horses`.* FROM `horses` ORDER BY `horses`.`speed` ASC
---
  def race
    @race_time_after_finish = 3000 # Wait 3s after the race is done
    @race_time = (Horse.maximum(:speed) * 1000) + @race_time_after_finish

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def payout_wagers
    user = Current.session.user
    winners = Horse.order(:speed).limit(3) # Get 1st, 2nd & 3rd place horses

    # Payout winning wagers
    winners.each.with_index(1) do |winner, place|
      Wager.where(horse_id: winner.id, user_id: user.id).select { |wager| wager.hits? place }.each(&:fufill)