app/controllers/horse_race_controller.rb

SELECT `horses`.* FROM `horses` ORDER BY `horses`.`speed` ASC LIMIT 3
SELECT MAX(`horses`.`speed`) FROM `horses`
SELECT `wagers`.* FROM `wagers`
---
  def resolve_race
    winners = Horse.order(:speed).limit(3) # Get 1st, 2nd & 3rd place horses

    winners.each.with_index(1) do |winner, place|
      Wager.select {|wager| wager.horse_id == winner.id and wager.hits? place }.each do |wager|

SELECT `horses`.* FROM `horses` WHERE `horses`.`id` = 2 LIMIT 1
INSERT INTO `wagers` (`amount`, `kind`, `user_id`, `horse_id`, `created_at`, `updated_at`) VALUES (123.0, 'straight', 1, 2, '2025-02-18 20:15:16.555535', '2025-02-18 20:15:16.555535')
UPDATE `users` SET `users`.`updated_at` = '2025-02-18 20:15:16.582096', `users`.`balance` = 1000024207.81 WHERE `users`.`id` = 1
---
  def submit_bet
    user   = Current.session.user
    horse  = Horse.find(params[:horse])
    kind   = params[:kind].to_s
    amount = params[:amount].to_f
    puts "#{kind.to_s.capitalize} Bet of $#{'%.2f' % amount} on '#{horse}'"

    Wager.new(user: user, horse: horse, amount: amount, kind: kind).save

    Current.session.user.balance -= amount
    Current.session.user.save