app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`email_address`, `password_digest`, `created_at`, `updated_at`, `balance`, `username`) VALUES ('test@testmail.com', '$2a$12$/depROscBWeRbKaZVPzSeuu96b3rMPQOgrWslEZyNhWaMLV0eOr.q', '2025-02-15 01:41:43.609057', '2025-02-15 01:41:43.609057', 0.0, 'asdf_-')

  def show
    if Current.session.user.username == params[:id]
      @user = User.find_by username: params[:id]
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'penispenis' LIMIT 1