app/models/wager.rb

  def payout
    odds = Horse.find(self.horse_id).odds(self.kind)
---
SELECT `horses`.* FROM `horses` WHERE `horses`.`id` = 2 LIMIT 1

  def fufill
    puts "Paying '#{User.find(self.user_id).username}' $#{'%.2f' % self.payout} for a #{self.kind.to_s.capitalize} bet of on '#{Horse.find(self.horse_id).name}'"
    user = User.find(self.user_id)
    user.balance += self.payout
    user.save
---
SELECT `horses`.* FROM `horses` WHERE `horses`.`id` = 7 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2025-02-19 04:10:58.512891', `users`.`balance` = 1035979200.81 WHERE `users`.`id` = 1